import React from 'react';
import Menu from './Menu';
import MobileMenu from './MobileMenu';
import style from '../styles/rec3.css';
import Searchbar from './Searchbar';
import More from './More';

class Rec3 extends React.Component{




    state= { w : window.innerWidth };

    updateWidth(){
        
            let update_width = window.innerWidth;
            this.setState({w:update_width});
        
    }

    /**
   * Add event listener
   */

    componentDidMount() {
        this.updateWidth();
        window.addEventListener("resize", this.updateWidth.bind(this));
    }

    /**
   * Remove event listener
   */
    componentWillUnmount() {
        window.removeEventListener("resize", this.updateWidth.bind(this));
    }




    render(){

        if(this.state.w>1000){
        return(
            <div>
                <div className='left-side'>
                    <h4 className='welcome-rec'>Φασολάδα με λουκάνικο</h4>
                    

                    <div className='image-wrapper-loukaniko'>
                    <Menu />
                    </div>
                   
                </div>
                            
                <div className='right-side'>
                <More/>
                <Searchbar/>
                             <h3>Συστατικά</h3>
                             <br>
                             </br>
                             <br>
                             </br>

                            <p>-400 gr Φασόλια Λευκά</p>
                            <p>-300 gr Χωριάτικό Λουκάνικο κυρά Δανάη</p>

                            <p>-2 Κρεμμύδια</p>

                            <p>-1 Σκόρδο</p>

                            <p>-Πράσο</p>

                            <p>-Σέλινο</p>

                            <p>-Καρότο</p>

                            <p>-Δάφνη</p>

                            <p>-1 κ.σ. Ζάχαρη</p>

                            <p>-1 κ.σ. Τοματοπελτέ</p>

                            <p>-Αλάτι, πιπέρι</p>

                            <p>-Πάπρικα</p>

                            <p>-Θυμάρι</p>

                            <p>-150 ml Ελαιόλαδο></p>

                            <br></br>

                            <h3>Οδηγίες</h3>
                            <br></br>

                            <p>1.Βάζουμε μια μέρα πριν τα φασόλια να μουλιάσουν σε νερό. Την επόμενη μέρα τα βράζουμε μέχρι να μαλακώσουν καλά.</p>

                            <p>2.Κόβουμε τα λαχανικά σε κομμάτια και το χωριάτικο λουκάνικο κυρά Δανάη σε φέτες. Προθερμαίνουμε τον φούρνο στους 200°C.</p>

                            <p>3.Σωτάρουμε το λουκάνικο και μόλις πάρει χρώμα προσθέτουμε τα λαχανικά και σωτάρουμε για 2-3 λεπτά.</p>

                            <p>4.Σε ένα πυρίμαχο σκεύος με καπάκι προσθέτουμε τα φασόλια, τα σωταρισμένα υλικά, τα μυρωδικά και τα μπαχαρικά. Προσθέτουμε τον τοματοπελτέ, τη ζάχαρη, το λάδι και βάζουμε αλάτι. Ανακατεύουμε καλά. Προσθέτουμε ζεστό νερό, μέχρι να καλυφθούν τα φασόλια. Αφήνουμε να βράσει, μέχρι να χυλώσει.</p>

                            <p>5.Ψήνουμε για 4 περίπου ώρες σε μέτρια θερμοκρασία. Σερβίρουμε στα πιάτα και θέλουμε προσθέτουμε λίγο μπούκοβο.</p>











                   


                </div>

            </div>
        );
        }
        else{
            return(
                <div>
                    <div className='left-side'>
                    

                <div className='image-wrapper-loukaniko'>
               < MobileMenu />
                <h4 className='welcome-rec'>Φασολάδα με λουκάνικο</h4>
                </div>
                </div>
                <div className='right-side'>
                <More/>
                <Searchbar/>
                             <h3>Συστατικά</h3>
                            <p>-400 gr Φασόλια Λευκά</p>
                            <p>-300 gr Χωριάτικό Λουκάνικο κυρά Δανάη</p>

                            <p>-2 Κρεμμύδια</p>

                            <p>-1 Σκόρδο</p>

                            <p>-Πράσο</p>

                            <p>-Σέλινο</p>

                            <p>-Καρότο</p>

                            <p>-Δάφνη</p>

                            <p>-1 κ.σ. Ζάχαρη</p>

                            <p>-1 κ.σ. Τοματοπελτέ</p>

                            <p>-Αλάτι, πιπέρι</p>

                            <p>-Πάπρικα</p>

                            <p>-Θυμάρι</p>

                            <p>-150 ml Ελαιόλαδο></p>

                            <br></br>

                            <h3>Οδηγίες</h3>
                            <br></br>

                            <p>1.Βάζουμε μια μέρα πριν τα φασόλια να μουλιάσουν σε νερό. Την επόμενη μέρα τα βράζουμε μέχρι να μαλακώσουν καλά.</p>

                            <p>2.Κόβουμε τα λαχανικά σε κομμάτια και το χωριάτικο λουκάνικο κυρά Δανάη σε φέτες. Προθερμαίνουμε τον φούρνο στους 200°C.</p>

                            <p>3.Σωτάρουμε το λουκάνικο και μόλις πάρει χρώμα προσθέτουμε τα λαχανικά και σωτάρουμε για 2-3 λεπτά.</p>

                            <p>4.Σε ένα πυρίμαχο σκεύος με καπάκι προσθέτουμε τα φασόλια, τα σωταρισμένα υλικά, τα μυρωδικά και τα μπαχαρικά. Προσθέτουμε τον τοματοπελτέ, τη ζάχαρη, το λάδι και βάζουμε αλάτι. Ανακατεύουμε καλά. Προσθέτουμε ζεστό νερό, μέχρι να καλυφθούν τα φασόλια. Αφήνουμε να βράσει, μέχρι να χυλώσει.</p>

                            <p>5.Ψήνουμε για 4 περίπου ώρες σε μέτρια θερμοκρασία. Σερβίρουμε στα πιάτα και θέλουμε προσθέτουμε λίγο μπούκοβο.</p>











                   


                </div>

                </div>
            );
        }
    }
};

export default Rec3;





