import React from 'react';
import Menu from './Menu';
import MobileMenu from './MobileMenu';
import style from '../styles/Spaghetti.css';
import Searchbar from './Searchbar';
import More from './More';

class SpaghettiRecipe extends React.Component{




    state= { w : window.innerWidth };

    updateWidth(){
        
            let update_width = window.innerWidth;
            this.setState({w:update_width});
        
    }

    /**
   * Add event listener
   */

    componentDidMount() {
        this.updateWidth();
        window.addEventListener("resize", this.updateWidth.bind(this));
    }

    /**
   * Remove event listener
   */
    componentWillUnmount() {
        window.removeEventListener("resize", this.updateWidth.bind(this));
    }




    render(){

        if(this.state.w>1000){
        return(
            <div>
                <div className='left-side'>
                    <h4 className='welcome-rec'>Spaghetti με pesto λιαστής ντομάτας και απάκι κοτόπουλο</h4>
                    

                    <div className='image-wrapper-spaghetti'>
                    <Menu />
                    </div>
                   
                </div>
                            
                <div className='right-side'><More/><Searchbar/>
                    <h2>Συστατικά</h2>
                    <h4>Για 4 άτομα</h4>
                    <br></br>

                    -500gr spaghetti
                    <br></br>

                    -200gr απάκι κοτόπουλο κυρά Δανάη
                    <br></br>

                    -50m ελαιόλαδο
                    <br></br>

                    -αλάτι
                    <br></br>

                    -φρεσκοτριμμένο μαύρο πιπέρι
                    <br></br>

                    -γλυκιά πάπρικα
                    <br></br>

                    -φρέσκο θυμάρι
                    <br></br>

                    -μισό λεμόνι
                    <br></br>
                    <br></br>
                    <br></br>

                    Για το pesto
                    <br></br>
                    <br></br>
                    -100gr λιαστές τομάτες
                    <br></br>

                    -20gr κουκουνάρι
                    <br></br>

                    -20gr καθαρισμένος ηλιόσπορος
                    <br></br>

                    -φύλλα πλατύφυλλου βασιλικού
                    <br></br>

                    -φύλλα μαϊντανού
                    <br></br>

                    -20ml λευκό ξύδι
                    <br></br>

                    -50gr παρμεζάνα
                    <br></br>

                    -γλυκιά πάπρικα
                    <br></br>

                    -40ml ελαιόλαδο
                    <br></br>

                    -φρεσκοτριμμένο μαύρο πιπέρι
                    <br></br>
                    <br></br>
                    <br></br>

                    

                    Οδηγίες
                    <br></br>
                    <br></br>
                    <br></br>
                    <h2>Για το pesto</h2>
                    <br></br>
                    <br></br>
                    Το pesto είναι μια κλασσική ιταλική παρασκευή, η οποία κλασσικά (και ετυμολογικά) γίνεται συνθλίβοντας τα συστατικά με το χέρι, σε γουδί, και συνήθως αναφέρεται στο pesto alla Genovese, τη γνωστή σάλτσα που έχει ως βασικά υλικά το βασιλικό, το σκόρδο, το pecorino και το ελαιόλαδο.
                    <br></br>
                    <br></br>

                    Η χρήση του ελαιόλαδου ως σχεδόν αποκλειστικό λιπαρό στοιχείο στις pesto παρασκευές, καθώς και το γεγονός ότι για βασικό υλικό έχουν κάποιο μυρωδικό ή λαχανικό, τις καθιστά ιδιαίτερα υγιεινές και ελαφριές σάλτσες, ιδανικές για καλοκαιρινά γεύματα!
                    <br></br>
                    <br></br>
                    Για το δικό μας pesto, στραγγίζουμε μερικώς τις λιαστές τομάτες και κόβουμε την κάθε μία σε 5-6 κομμάτια. (Για να πετύχουμε καλύτερη υφή, συνίσταται για το συγκεκριμένο pesto να χρησιμοποιηθεί blender.) Τοποθετούμε τις τομάτες, το κουκουνάρι, τον ηλιόσπορο, την παρμεζάνα, το βασιλικό, το μαϊντανό, τη μισή ποσότητα ξυδιού και τη μισή ποσότητα λαδιού στο blender και χτυπάμε καλά. Προσθέτουμε λίγη πάπρικα και λίγο πιπέρι και χτυπάμε ξανά. Δοκιμάζουμε και εάν το pesto μας χρειάζεται περισσότερη οξύτητα, συμπληρώνουμε με το υπόλοιπο ξύδι. Επίσης, αν δεν έχουμε πετύχει υφή που να μοιάζει με πάστα ελιάς, συμπληρώνουμε με το υπόλοιπο λάδι. Αδειάζουμε το pesto σε αποστειρωμένο βαζάκι και το διατηρούμε στην ψύξη.
                    <br></br>
                    <br></br>
                    {/* <b>Tip: </b> φτιάχνιυμε το pesto την προηγούμενη μέρα από τη μέρα που πρόκειται να το χρησιμοποιήσουμε και το διατηρούμε στην ψύξη. Τα αρώματά του θα έχουν δέσει πολύ καλύτερα. */}
                    <br></br>
                    <br></br>
                   <h2>Για το απάκι</h2>
                    <br></br>
                    <br></br>
                    <br></br>
                    Κόβουμε το απάκι σε μπαστουνάκια πάχους 1cm. Θερμαίνουμε ένα αντικολλητικό τηγάνι και έπειτα ρίχνουμε 2 κ.σ. ελαιόλαδο. Όταν το λάδι ζεσταθεί καλά, ρίχνουμε μέσα το απάκι. Φροντίζουμε τα μπαστουνάκια να είναι καλά απλωμένα και όχι κολλημένα μεταξύ τους. Με αυτόν τον τρόπο θα αποκτήσουν τραγανή υφή. Αλατοπιπερώνουμε, προσθέτουμε το φρέσκο θυμάρι και όταν σωταριστούν από όλες τις μεριές, σβήνουμε με το χυμό από μισό λεμόνι και αποσύρουμε από την εστία.
                    <br></br>
                    <br></br>
                    <h2>Για τα spaghetti</h2>
                    <br></br>
                    <br></br>
                    <br></br>
                    Βράζουμε τα ζυμαρικά και με ένα μπρίκι διατηρούμε αρκετό από το ζεστό νερό μέσα στο οποίο έβρασαν.
                    <br></br>

                     <br></br>
                    <b>Tips</b> : Το οικιακό μαγείρεμα ζυμαρικών διέπει ένας βασικός κανόνας· αυτός που αναγράφεται στη συσκευασία. Τα λεπτά μαγειρέματος που αναγράφονται δείχνουν το χρόνο που απαιτείται ώστε να έχουμε από al dente μέχρι παραπάνω μαγειρεμένα ζυμαρικά. Αφού βράσει το νερό, προσθέτουμε αλάτι, 1 κ.σ. ελαιόλαδο και ανακατεύουμε. Μετά προσθέτουμε τα spaghetti με τρόπο ώστε να μην κολλήσουν οι άκρες τους. Ο χρόνος αρχίζει να μετράει από τη στιγμή που θα επανέλθει ο βρασμός του νερού, αφού με την προσθήκη των ζυμαρικών, η θερμοκρασία του νερού πέφτει από τους 100◦C.
                    <br></br>
                    <br></br>
                    Τα al dente ζυμαρικά είναι πιο νόστιμα και εύπεπτα. Αν πρόκειται να τελειώσουμε το μαγείρεμά τους σε ζεστή σάλτσα, πρέπει να αφαιρέσουμε το χρόνο που θα μαγειρευτούν στη σάλτσα από το χρόνο που θα τα βράσουμε. Αν όχι, όπως στην περίπτωσή μας, πρέπει να σταματήσουμε το βρασμό απότομα, όταν έχουμε πετύχει το επιθυμητό μαγείρεμα στα spaghetti, με τον εξής τρόπο : Σουρώνουμε τα ζυμαρικά και γεμίζουμε με κρύο νερό την κατσαρόλα που έβραζαν. Ρίχνουμε τα ζυμαρικά μέσα στο κρύο νερό και ανακατεύουμε, ώστε να παγώσουν σε όλη τη μάζα τους. Σουρώνουμε ξανά και τα αφήνουμε στην άκρη.
                    <br></br>
                    <br></br>
                    <h2>Για το τελείωμα του πιάτου</h2> <br></br>
                    <br></br>
                    Για κάθε μερίδα, βάζουμε σε ένα ανοιχτό μεταλλικό μπολ 1-1.5 κ.σ. από το pesto και 2 κ.σ. από το ζεστό νερό που κρατήσαμε. Το νερό αυτό έχει αρκετό άμυλο και είναι το μέσο που χρησιμοποιούμε εδώ για να αραιώσουμε το pesto και να δέσουμε τη σάλτσα με τα ζυμαρικά. Υπάρχουν αρκετοί άλλοι τρόποι για αυτή τη διαδικασία (π.χ. με κρέμα γάλακτος, με βούτυρο κλπ), αλλά αυτός ο τρόπος είναι αρκετά αποτελεσματικός και μας γλιτώνει από περιττά λιπαρά. Ανακατεύουμε καλά και προσθέτουμε το ένα τέταρτο από το σωταρισμένο απάκι και μία μερίδα spaghetti. Ανακατεύουμε ξανά ώστε τα ζυμαρικά να απορροφήσουν όλη τη σάλτσα και σερβίρουμε. Μπορούμε να γαρνίρουμε με παρμεζάνα, γλυκιά πάπρικα, βασιλικό ή τοματίνια.
                    <br></br>
                    <br></br>
                    <br></br>
                    recipe By Maria Tzamtzi

                     <br></br>
                     <br></br>
                     <br></br>


                </div>

            </div>
        );
        }
        else{
            return(
                <div>
                    <div className='left-side'>
                <div className='image-wrapper-spaghetti'>
                <MobileMenu />
                <h4 className='welcome-rec'>Spaghetti με pesto λιαστής ντομάτας και απάκι κοτόπουλο</h4>
                </div>
                </div>
                <div className='right-side'><More/><Searchbar/>
                    <h2>Συστατικά</h2>
                    <h4>Για 4 άτομα</h4>
                    <br></br>

                    -500gr spaghetti
                    <br></br>

                    -200gr απάκι κοτόπουλο κυρά Δανάη
                    <br></br>

                    -50m ελαιόλαδο
                    <br></br>

                    -αλάτι
                    <br></br>

                    -φρεσκοτριμμένο μαύρο πιπέρι
                    <br></br>

                    -γλυκιά πάπρικα
                    <br></br>

                    -φρέσκο θυμάρι
                    <br></br>

                    -μισό λεμόνι
                    <br></br>
                    <br></br>
                    <br></br>

                    Για το pesto
                    <br></br>
                    <br></br>
                    -100gr λιαστές τομάτες
                    <br></br>

                    -20gr κουκουνάρι
                    <br></br>

                    -20gr καθαρισμένος ηλιόσπορος
                    <br></br>

                    -φύλλα πλατύφυλλου βασιλικού
                    <br></br>

                    -φύλλα μαϊντανού
                    <br></br>

                    -20ml λευκό ξύδι
                    <br></br>

                    -50gr παρμεζάνα
                    <br></br>

                    -γλυκιά πάπρικα
                    <br></br>

                    -40ml ελαιόλαδο
                    <br></br>

                    -φρεσκοτριμμένο μαύρο πιπέρι
                    <br></br>
                    <br></br>
                    <br></br>

                    

                    Οδηγίες
                    <br></br>
                    <br></br>
                    <br></br>
                    <h2>Για το pesto</h2>
                    <br></br>
                    <br></br>
                    Το pesto είναι μια κλασσική ιταλική παρασκευή, η οποία κλασσικά (και ετυμολογικά) γίνεται συνθλίβοντας τα συστατικά με το χέρι, σε γουδί, και συνήθως αναφέρεται στο pesto alla Genovese, τη γνωστή σάλτσα που έχει ως βασικά υλικά το βασιλικό, το σκόρδο, το pecorino και το ελαιόλαδο.
                    <br></br>
                    <br></br>

                    Η χρήση του ελαιόλαδου ως σχεδόν αποκλειστικό λιπαρό στοιχείο στις pesto παρασκευές, καθώς και το γεγονός ότι για βασικό υλικό έχουν κάποιο μυρωδικό ή λαχανικό, τις καθιστά ιδιαίτερα υγιεινές και ελαφριές σάλτσες, ιδανικές για καλοκαιρινά γεύματα!
                    <br></br>
                    <br></br>
                    Για το δικό μας pesto, στραγγίζουμε μερικώς τις λιαστές τομάτες και κόβουμε την κάθε μία σε 5-6 κομμάτια. (Για να πετύχουμε καλύτερη υφή, συνίσταται για το συγκεκριμένο pesto να χρησιμοποιηθεί blender.) Τοποθετούμε τις τομάτες, το κουκουνάρι, τον ηλιόσπορο, την παρμεζάνα, το βασιλικό, το μαϊντανό, τη μισή ποσότητα ξυδιού και τη μισή ποσότητα λαδιού στο blender και χτυπάμε καλά. Προσθέτουμε λίγη πάπρικα και λίγο πιπέρι και χτυπάμε ξανά. Δοκιμάζουμε και εάν το pesto μας χρειάζεται περισσότερη οξύτητα, συμπληρώνουμε με το υπόλοιπο ξύδι. Επίσης, αν δεν έχουμε πετύχει υφή που να μοιάζει με πάστα ελιάς, συμπληρώνουμε με το υπόλοιπο λάδι. Αδειάζουμε το pesto σε αποστειρωμένο βαζάκι και το διατηρούμε στην ψύξη.
                    <br></br>
                    <br></br>
                    <h4>Tip </h4> Φτιάχνουμε το pesto την προηγούμενη μέρα από τη μέρα που πρόκειται να το χρησιμοποιήσουμε και το διατηρούμε στην ψύξη. Τα αρώματά του θα έχουν δέσει πολύ καλύτερα.
                    <br></br>
                    <br></br>
                   <h2>Για το απάκι</h2>
                    <br></br>
                    <br></br>
                    <br></br>
                    Κόβουμε το απάκι σε μπαστουνάκια πάχους 1cm. Θερμαίνουμε ένα αντικολλητικό τηγάνι και έπειτα ρίχνουμε 2 κ.σ. ελαιόλαδο. Όταν το λάδι ζεσταθεί καλά, ρίχνουμε μέσα το απάκι. Φροντίζουμε τα μπαστουνάκια να είναι καλά απλωμένα και όχι κολλημένα μεταξύ τους. Με αυτόν τον τρόπο θα αποκτήσουν τραγανή υφή. Αλατοπιπερώνουμε, προσθέτουμε το φρέσκο θυμάρι και όταν σωταριστούν από όλες τις μεριές, σβήνουμε με το χυμό από μισό λεμόνι και αποσύρουμε από την εστία.
                    <br></br>
                    <br></br>
                    <h2>Για τα spaghetti</h2>
                    <br></br>
                    <br></br>
                    <br></br>
                    Βράζουμε τα ζυμαρικά και με ένα μπρίκι διατηρούμε αρκετό από το ζεστό νερό μέσα στο οποίο έβρασαν.
                    <br></br>

                     <br></br>
                    <b>Tips</b> : Το οικιακό μαγείρεμα ζυμαρικών διέπει ένας βασικός κανόνας· αυτός που αναγράφεται στη συσκευασία. Τα λεπτά μαγειρέματος που αναγράφονται δείχνουν το χρόνο που απαιτείται ώστε να έχουμε από al dente μέχρι παραπάνω μαγειρεμένα ζυμαρικά. Αφού βράσει το νερό, προσθέτουμε αλάτι, 1 κ.σ. ελαιόλαδο και ανακατεύουμε. Μετά προσθέτουμε τα spaghetti με τρόπο ώστε να μην κολλήσουν οι άκρες τους. Ο χρόνος αρχίζει να μετράει από τη στιγμή που θα επανέλθει ο βρασμός του νερού, αφού με την προσθήκη των ζυμαρικών, η θερμοκρασία του νερού πέφτει από τους 100◦C.
                    <br></br>
                    <br></br>
                    Τα al dente ζυμαρικά είναι πιο νόστιμα και εύπεπτα. Αν πρόκειται να τελειώσουμε το μαγείρεμά τους σε ζεστή σάλτσα, πρέπει να αφαιρέσουμε το χρόνο που θα μαγειρευτούν στη σάλτσα από το χρόνο που θα τα βράσουμε. Αν όχι, όπως στην περίπτωσή μας, πρέπει να σταματήσουμε το βρασμό απότομα, όταν έχουμε πετύχει το επιθυμητό μαγείρεμα στα spaghetti, με τον εξής τρόπο : Σουρώνουμε τα ζυμαρικά και γεμίζουμε με κρύο νερό την κατσαρόλα που έβραζαν. Ρίχνουμε τα ζυμαρικά μέσα στο κρύο νερό και ανακατεύουμε, ώστε να παγώσουν σε όλη τη μάζα τους. Σουρώνουμε ξανά και τα αφήνουμε στην άκρη.
                    <br></br>
                    <br></br>
                    <h2>Για το τελείωμα του πιάτου</h2> <br></br>
                    <br></br>
                    Για κάθε μερίδα, βάζουμε σε ένα ανοιχτό μεταλλικό μπολ 1-1.5 κ.σ. από το pesto και 2 κ.σ. από το ζεστό νερό που κρατήσαμε. Το νερό αυτό έχει αρκετό άμυλο και είναι το μέσο που χρησιμοποιούμε εδώ για να αραιώσουμε το pesto και να δέσουμε τη σάλτσα με τα ζυμαρικά. Υπάρχουν αρκετοί άλλοι τρόποι για αυτή τη διαδικασία (π.χ. με κρέμα γάλακτος, με βούτυρο κλπ), αλλά αυτός ο τρόπος είναι αρκετά αποτελεσματικός και μας γλιτώνει από περιττά λιπαρά. Ανακατεύουμε καλά και προσθέτουμε το ένα τέταρτο από το σωταρισμένο απάκι και μία μερίδα spaghetti. Ανακατεύουμε ξανά ώστε τα ζυμαρικά να απορροφήσουν όλη τη σάλτσα και σερβίρουμε. Μπορούμε να γαρνίρουμε με παρμεζάνα, γλυκιά πάπρικα, βασιλικό ή τοματίνια.
                    <br></br>
                    <br></br>
                    <br></br>
                    recipe By Maria Tzamtzi

                     <br></br>
                     <br></br>
                     <br></br>


                </div>
                </div>
            );
        }
    }
};

export default SpaghettiRecipe;

